_src/wiki/2016-05-06-mysql-ignore.org
# -*- coding: utf-8-unix; -*-
#+TITLE:       MySQL中的insert ignore into, replace into等的一些用法总结
#+AUTHOR:      Bruce Asu
#+EMAIL:       bruceasu@163.com
#+DATE:        <2016-05-06 20:48>
#+filetags:    mysql

#+LANGUAGE:    en
#+OPTIONS:     H:7 num:nil toc:nil \n:nil ::t |:t ^:nil -:nil f:t *:t <:nil

* MySQL replace into 有三种形式：
1. replace into tbl_name(col_name, ...) values(...)
2. replace into tbl_name(col_name, ...) select ...
3. replace into tbl_name set col_name=value, ...

* insert ignore into
当插入数据时，如出现错误时，如重复数据，将不返回错误，只以警告形式返回。所以使用
ignore请确保语句本身没有问题，否则也会被忽略掉。例如：
: INSERT IGNORE INTO books (name) VALUES ('MySQL Manual')

* on duplicate key update
当primary或者unique重复时，则执行update语句，如update后为无用语句，如id=id，则同
1功能相同，但错误不会被忽略掉。例如，为了实现name重复的数据插入不报错，可使用一
下语句：
: INSERT INTO books (name) VALUES ('MySQL Manual') ON duplicate KEY UPDATE id = id

* insert … select … where not exist
根据select的条件判断是否插入，可以不光通过primary 和unique来判断，也可通过其它条
件。例如：
: INSERT INTO books (name) SELECT 'MySQL Manual' FROM dual WHERE NOT EXISTS (SELECT id FROM books WHERE id = 1)

* replace into
如果存在primary or unique相同的记录，则先删除掉。再插入新记录。
: REPLACE INTO books SELECT 1, 'MySQL Manual' FROM books
